In [1]:
import numpy as np
import pandas as pd

## Creating DataFrame Objects

In [2]:
arr = np.random.randint(0,10,(5, 3))

In [3]:
arr

array([[0, 2, 6],
       [0, 5, 3],
       [1, 7, 2],
       [1, 2, 0],
       [6, 2, 5]])

In [4]:
df = pd.DataFrame(arr)

In [5]:
df

   0  1  2
0  0  2  6
1  0  5  3
2  1  7  2
3  1  2  0
4  6  2  5

In [6]:
df.values

array([[0, 2, 6],
       [0, 5, 3],
       [1, 7, 2],
       [1, 2, 0],
       [6, 2, 5]])

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [9]:
for c in df.columns:
    print(c)

0
1
2

In [10]:
df.values[0]

array([0, 2, 6])

In [11]:
df.index = ['R1','R2','R3','R4','R5']
df.columns = ['C1','C2','C3']

In [12]:
df

    C1  C2  C3
R1   0   2   6
R2   0   5   3
R3   1   7   2
R4   1   2   0
R5   6   2   5

In [13]:
df.loc['R3','C2']

7

In [14]:
df.iloc[2,1]

7

In [15]:
type(df.iloc[2:4,1:3])

pandas.core.frame.DataFrame

In [16]:
df.loc['R3':'R5', 'C2':'C3']

    C2  C3
R3   7   2
R4   2   0
R5   2   5

In [17]:
df.iloc[0]

C1    0
C2    2
C3    6
Name: R1, dtype: int32

In [18]:
type(df.iloc[0])

pandas.core.series.Series

In [19]:
df.iloc[:, 0]

R1    0
R2    0
R3    1
R4    1
R5    6
Name: C1, dtype: int32

In [20]:
df.shape

(5, 3)

In [21]:
df.T

    R1  R2  R3  R4  R5
C1   0   0   1   1   6
C2   2   5   7   2   2
C3   6   3   2   0   5

### Task on Creating Dataframes

In [22]:
def create_df(nRows, nCols, maxRand=10):
    arr = np.random.randint(0, maxRand, (nRows, nCols))
    df = pd.DataFrame(arr)
    df.index = ['R'  + str(x) for x in np.arange(1, nRows+1)]
    df.columns = ['C' + str(x) for x in np.arange(1, nCols+1)]
    return df

In [23]:
create_df(5, 3)

    C1  C2  C3
R1   7   4   8
R2   4   6   1
R3   0   9   1
R4   0   1   7
R5   8   4   4

In [24]:
create_df(2, 5)

    C1  C2  C3  C4  C5
R1   7   4   1   7   8
R2   0   5   6   1   2

In [25]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146],
        index=['Mercury','Venus','Earth','Mars','Jupiter','Saturn','Uranus','Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370],
                     index=['Mercury','Venus','Earth','Moon','Mars','Jupiter','Saturn','Uranus','Neptune','Pluto'])

In [26]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [27]:
diameter

Mercury      4879
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [28]:
df = pd.DataFrame({'Mass':mass ,'Diameter':diameter})

In [29]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [30]:
df['Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [31]:
# df['Earth']

In [32]:
df['Mass']['Earth']

5.97

In [33]:
df['pop'] = 0

In [34]:
df

              Mass  Diameter  pop
Earth       5.9700     12756    0
Jupiter  1898.0000    142984    0
Mars        0.6420      6792    0
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [35]:
df['pop']['Earth']= 800000

c:\users\admin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [36]:
df

              Mass  Diameter     pop
Earth       5.9700     12756  800000
Jupiter  1898.0000    142984       0
Mars        0.6420      6792       0
Mercury     0.3300      4879       0
Moon           NaN      3475       0
Neptune   102.0000     49528       0
Pluto       0.0146      2370       0
Saturn    568.0000    120536       0
Uranus     86.8000     51118       0
Venus       4.8700     12104       0

In [37]:
df['Mass'] is df.Mass

True

In [38]:
df['pop'] is df.pop

False

In [39]:
df.loc['Earth']

Mass             5.97
Diameter     12756.00
pop         800000.00
Name: Earth, dtype: float64

In [40]:
df.loc[:, 'Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

#### How to create new Row Function

In [41]:
def create_mean_row(df):
    df.loc['Col_Mean'] = [np.mean(df[col]) for col in df.columns]
    return df

In [42]:
df

              Mass  Diameter     pop
Earth       5.9700     12756  800000
Jupiter  1898.0000    142984       0
Mars        0.6420      6792       0
Mercury     0.3300      4879       0
Moon           NaN      3475       0
Neptune   102.0000     49528       0
Pluto       0.0146      2370       0
Saturn    568.0000    120536       0
Uranus     86.8000     51118       0
Venus       4.8700     12104       0

In [43]:
df.loc['Col_Mean']=0

In [44]:
df

               Mass  Diameter     pop
Earth        5.9700     12756  800000
Jupiter   1898.0000    142984       0
Mars         0.6420      6792       0
Mercury      0.3300      4879       0
Moon            NaN      3475       0
Neptune    102.0000     49528       0
Pluto        0.0146      2370       0
Saturn     568.0000    120536       0
Uranus      86.8000     51118       0
Venus        4.8700     12104       0
Col_Mean     0.0000         0       0

In [45]:
np.mean(df['Mass'])

266.66266

In [46]:
df.drop('Col_Mean', inplace=True)

In [47]:
np.mean(df['Mass'])

296.29184444444445

In [48]:
df.drop('pop', axis=1, inplace=True)

In [49]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [50]:
np.mean(df['Mass'])

296.29184444444445

In [51]:
df.loc['Col_Mean'] = [np.mean(df['Mass']), np.mean(df['Diameter'])]

In [52]:
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [53]:
 df.drop('Col_Mean')

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [54]:
create_mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [55]:
df = create_df(5, 3)

In [56]:
df

    C1  C2  C3
R1   3   2   7
R2   0   3   4
R3   5   1   7
R4   5   7   1
R5   1   4   7

In [57]:
df.mean()

C1    2.8
C2    3.4
C3    5.2
dtype: float64

In [58]:
df.mean(axis=1)

R1    4.000000
R2    2.333333
R3    4.333333
R4    4.333333
R5    4.000000
dtype: float64

In [59]:
df['Row_Mean'] = df.mean(axis=1)

In [60]:
df.loc['Col_Mean'] = df.mean()

In [61]:
df

           C1   C2   C3  Row_Mean
R1        3.0  2.0  7.0  4.000000
R2        0.0  3.0  4.0  2.333333
R3        5.0  1.0  7.0  4.333333
R4        5.0  7.0  1.0  4.333333
R5        1.0  4.0  7.0  4.000000
Col_Mean  2.8  3.4  5.2  3.800000

In [62]:
df.median()

C1          2.9
C2          3.2
C3          6.1
Row_Mean    4.0
dtype: float64

In [63]:
df.min()

C1          0.000000
C2          1.000000
C3          1.000000
Row_Mean    2.333333
dtype: float64

In [64]:
df.max()

C1          5.000000
C2          7.000000
C3          7.000000
Row_Mean    4.333333
dtype: float64

In [65]:
df.quantile(0.25)

C1          1.45
C2          2.25
C3          4.30
Row_Mean    3.85
Name: 0.25, dtype: float64

In [66]:
df.drop('Row_Mean', axis=1)

           C1   C2   C3
R1        3.0  2.0  7.0
R2        0.0  3.0  4.0
R3        5.0  1.0  7.0
R4        5.0  7.0  1.0
R5        1.0  4.0  7.0
Col_Mean  2.8  3.4  5.2

In [67]:
df.describe()

             C1        C2   C3  Row_Mean
count  6.000000  6.000000  6.0  6.000000
mean   2.800000  3.400000  5.2  3.800000
std    2.039608  2.059126  2.4  0.748331
min    0.000000  1.000000  1.0  2.333333
25%    1.450000  2.250000  4.3  3.850000
50%    2.900000  3.200000  6.1  4.000000
75%    4.500000  3.850000  7.0  4.250000
max    5.000000  7.000000  7.0  4.333333

In [68]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146],
        index=['Mercury','Venus','Earth','Mars','Jupiter','Saturn','Uranus','Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370],
                     index=['Mercury','Venus','Earth','Moon','Mars','Jupiter','Saturn','Uranus','Neptune','Pluto'])

In [69]:
planets = pd.DataFrame({'Mass': mass, 'Diameter':diameter})

In [70]:
planets.describe()

              Mass      Diameter
count     9.000000      10.00000
mean    296.291844   40654.20000
std     627.786429   51541.39142
min       0.014600    2370.00000
25%       0.642000    5357.25000
50%       5.970000   12430.00000
75%     102.000000   50720.50000
max    1898.000000  142984.00000

### Planets Dataset

In [71]:
import seaborn as sns

In [72]:
df = sns.load_dataset('planets')

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
method            1035 non-null object
number            1035 non-null int64
orbital_period    992 non-null float64
mass              513 non-null float64
distance          808 non-null float64
year              1035 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [74]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [75]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [76]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

####  Go through each row of the dataframe and delete it(drop) if any of the columns is null

In [77]:
for r in df.index:
    for c in df.columns:
        if pd.isnull(df.loc[r, c]):
            df.drop(r, inplace=True)
            break

In [78]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [79]:
for i, r in df.iterrows():
    print(i)
    print(r)
    break

0
method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [80]:
for i, r in df.iterrows():
    if pd.isnull(r).any():
        df.drop(i, inplace=True)
        break

In [81]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [82]:
df.dropna(inplace=True)

In [83]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Filter and show only those rows which have planets that are found in the 2010s and method is 'Radial Velocity' and 'Transit' and distance is large(> 75 percentile)

In [84]:
df_ = df.copy()
per_75 = df.distance.quantile(0.75)
for i,r in df.iterrows():
    if r['year']< 2010:
        df_.drop(i, inplace=True)
        continue
    if r['method']!='Radial Velocity' and r['method']!='Transit':
        df_.drop(i, inplace=True)
        continue
    if r['distance']< per_75:
        df_.drop(i, inplace=True)
        continue

In [85]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [86]:
df_.head()

             method  number  orbital_period   mass  distance  year
9   Radial Velocity       2          452.80   1.99     74.79  2010
10  Radial Velocity       2          883.00   0.86     74.79  2010
58  Radial Velocity       1          277.02   1.70     80.64  2013
63  Radial Velocity       1          305.50  20.60     92.51  2013
84  Radial Velocity       1          137.48   1.11    175.44  2013

In [87]:
df_ = df.copy()
df_ = df_[
    (df_['year']>=2010)&
    ((df_['method']=='Radial Velocity') | (df_['method']=='Transit'))&
    (df_['distance'] > per_75)
]

In [88]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

Modify the method column to have only the abbreviation of each method

In [89]:
df.method.unique()

array(['Radial Velocity', 'Transit'], dtype=object)

In [90]:
s = 'Radial Velocity'

In [91]:
''.join([x[0] for x in s.split(' ')])

'RV'

In [92]:
short_names={}
for s in df.method.unique():
    short_names[s] = ''.join([x[0] for x in s.split(' ')])

In [93]:
print(short_names)

{'Radial Velocity': 'RV', 'Transit': 'T'}

In [94]:
for i, r in df.iterrows():
    df.loc[i, 'short_method'] = short_names.get(r['method'], r['method'])

In [95]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

In [96]:
df = sns.load_dataset('planets')

In [97]:
def shorten_method(s):
    return short_names.get(s, s)

In [98]:
df['short_names'] = df['method'].apply(shorten_method)

In [99]:
df.head()

            method  number  orbital_period   mass  distance  year short_names
0  Radial Velocity       1         269.300   7.10     77.40  2006          RV
1  Radial Velocity       1         874.774   2.21     56.95  2008          RV
2  Radial Velocity       1         763.000   2.60     19.84  2011          RV
3  Radial Velocity       1         326.030  19.40    110.62  2007          RV
4  Radial Velocity       1         516.220  10.50    119.47  2009          RV

Count the number of planets discovered for each method type

1. **Split** the dataframe into smaller chunks(in this case they shouldhave the same method name)
2. **Apply** some function in each smaller chunk(in this case it is the count function)
3. **Aggregate** the result from each chunk together

In [100]:
d = {}
for m in df.method.unique():
    d[m] = df[df.method==m]['method'].count()
print(d)

{'Radial Velocity': 553, 'Imaging': 38, 'Eclipse Timing Variations': 9, 'Transit': 397, 'Astrometry': 2, 'Transit Timing Variations': 4, 'Orbital Brightness Modulation': 3, 'Microlensing': 23, 'Pulsar Timing': 5, 'Pulsation Timing Variations': 1}

In [101]:
df.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

In [102]:
df.groupby('method')['distance'].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

Find out what fraction of planets have been found in the last decade(i.e.,in 2010s) across each method type

1. **Filter** the data for given condition (in this case planet found in last decade)
2. **Split**(in this case across method)
3. **Apply** (in this case just count)
4. **Aggregate**(to represent the final result)

In [103]:
s_2010s = df[df.year >= 2010].groupby('method')['method'].count()

In [104]:
s_allTime = df.groupby('method')['method'].count()

In [105]:
s_2010s/s_allTime

method
Astrometry                       1.000000
Eclipse Timing Variations        0.666667
Imaging                          0.473684
Microlensing                     0.565217
Orbital Brightness Modulation    1.000000
Pulsar Timing                    0.200000
Pulsation Timing Variations           NaN
Radial Velocity                  0.388788
Transit                          0.843829
Transit Timing Variations        1.000000
Name: method, dtype: float64

### Find the datset of Nifty numbers for 2018 and 2019-daily numbers open,close, high, low

In [106]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv')

In [107]:
nifty50_2018.head()

          Date      Open      High       Low     Close
0  31 Dec 2018  10913.20  10923.55  10853.20  10862.55
1  28 Dec 2018  10820.95  10893.60  10817.15  10859.90
2  27 Dec 2018  10817.90  10834.20  10764.45  10779.80
3  26 Dec 2018  10635.45  10747.50  10534.55  10729.85
4  24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [108]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv',index_col=0)

In [109]:
nifty50_2018.head()

                 Open      High       Low     Close
Date
31 Dec 2018  10913.20  10923.55  10853.20  10862.55
28 Dec 2018  10820.95  10893.60  10817.15  10859.90
27 Dec 2018  10817.90  10834.20  10764.45  10779.80
26 Dec 2018  10635.45  10747.50  10534.55  10729.85
24 Dec 2018  10780.90  10782.30  10649.25  10663.50

In [110]:
nifty50_2018.loc['31 Dec 2018']

Open     10913.20
High     10923.55
Low      10853.20
Close    10862.55
Name: 31 Dec 2018, dtype: float64

In [111]:
nifty50_2018['Open']

Date
31 Dec 2018    10913.20
28 Dec 2018    10820.95
27 Dec 2018    10817.90
26 Dec 2018    10635.45
24 Dec 2018    10780.90
21 Dec 2018    10944.25
20 Dec 2018    10885.20
19 Dec 2018    10930.55
18 Dec 2018    10850.90
17 Dec 2018    10853.20
14 Dec 2018    10784.50
13 Dec 2018    10810.75
12 Dec 2018    10591.00
11 Dec 2018    10350.05
10 Dec 2018    10508.70
07 Dec 2018    10644.80
06 Dec 2018    10718.15
05 Dec 2018    10820.45
04 Dec 2018    10877.10
03 Dec 2018    10930.70
30 Nov 2018    10892.10
29 Nov 2018    10808.70
28 Nov 2018    10708.75
27 Nov 2018    10621.45
26 Nov 2018    10568.30
22 Nov 2018    10612.65
21 Nov 2018    10670.95
20 Nov 2018    10740.10
19 Nov 2018    10731.25
16 Nov 2018    10644.00
                 ...
12 Feb 2018    10518.20
09 Feb 2018    10416.50
08 Feb 2018    10518.50
07 Feb 2018    10607.20
06 Feb 2018    10295.15
05 Feb 2018    10604.30
02 Feb 2018    10938.20
01 Feb 2018    11044.55
31 Jan 2018    11018.80
30 Jan 2018    11120.85
29 Jan 2018    11079.35
25 Jan 2018    11095.60
24 Jan 2018    11069.35
23 Jan 2018    10997.40
22 Jan 2018    10883.20
19 Jan 2018    10829.20
18 Jan 2018    10873.40
17 Jan 2018    10702.45
16 Jan 2018    10761.50
15 Jan 2018    10718.50
12 Jan 2018    10682.55
11 Jan 2018    10637.05
10 Jan 2018    10652.05
09 Jan 2018    10645.10
08 Jan 2018    10591.70
05 Jan 2018    10534.25
04 Jan 2018    10469.40
03 Jan 2018    10482.65
02 Jan 2018    10477.55
01 Jan 2018    10531.70
Name: Open, Length: 246, dtype: float64

In [112]:
nifty50_2019 = pd.read_csv('NIFTY50_2019.csv',index_col=0)

In [113]:
nifty50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [114]:
print(nifty50_2018.shape, nifty50_2019.shape)

(246, 4) (245, 4)

In [115]:
nifty50 = pd.concat([nifty50_2018, nifty50_2019])

In [116]:
nifty50.shape

(491, 4)

In [117]:
niftynext50_2019 = pd.read_csv('NIFTYNext50_2019.csv', index_col=0)

In [118]:
niftynext50_2019.head()

                 Open      High       Low     Close
Date
31 Dec 2019  28495.00  28549.50  28270.25  28307.55
30 Dec 2019  28528.95  28612.95  28406.70  28484.85
27 Dec 2019  28354.50  28500.25  28319.90  28476.80
26 Dec 2019  28409.10  28435.25  28259.75  28280.25
24 Dec 2019  28423.70  28430.40  28318.75  28382.85

In [119]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1)

In [120]:
nifty_2019.shape

(245, 8)

In [121]:
nifty_2019.head()

,Open,High,Low,Close,Open,High,Low,Close
Date,,,,,,,,
31 Dec 2019,12247.10,12247.10,12151.80,12168.45,28495.00,28549.50,28270.25,28307.55
30 Dec 2019,12274.90,12286.45,12213.80,12255.85,28528.95,28612.95,28406.70,28484.85
27 Dec 2019,12172.90,12258.45,12157.90,12245.80,28354.50,28500.25,28319.90,28476.80
26 Dec 2019,12211.85,12221.55,12118.85,12126.55,28409.10,28435.25,28259.75,28280.25
24 Dec 2019,12269.25,12283.70,12202.10,12214.55,28423.70,28430.40,28318.75,28382.85

In [122]:
nifty_2019 = pd.concat([nifty50_2019, niftynext50_2019], axis=1,
                       keys=['nifty50','niftynext50'])

In [123]:
nifty_2019.shape

(245, 8)

In [124]:
nifty_2019.head()

              nifty50                               niftynext50            \
                 Open      High       Low     Close        Open      High
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45    28495.00  28549.50
30 Dec 2019  12274.90  12286.45  12213.80  12255.85    28528.95  28612.95
27 Dec 2019  12172.90  12258.45  12157.90  12245.80    28354.50  28500.25
26 Dec 2019  12211.85  12221.55  12118.85  12126.55    28409.10  28435.25
24 Dec 2019  12269.25  12283.70  12202.10  12214.55    28423.70  28430.40


                  Low     Close
Date
31 Dec 2019  28270.25  28307.55
30 Dec 2019  28406.70  28484.85
27 Dec 2019  28319.90  28476.80
26 Dec 2019  28259.75  28280.25
24 Dec 2019  28318.75  28382.85

In [125]:
nifty_2019['nifty50'].head()

                 Open      High       Low     Close
Date
31 Dec 2019  12247.10  12247.10  12151.80  12168.45
30 Dec 2019  12274.90  12286.45  12213.80  12255.85
27 Dec 2019  12172.90  12258.45  12157.90  12245.80
26 Dec 2019  12211.85  12221.55  12118.85  12126.55
24 Dec 2019  12269.25  12283.70  12202.10  12214.55

In [126]:
nifty_2019['nifty50']['Open'].head()

Date
31 Dec 2019    12247.10
30 Dec 2019    12274.90
27 Dec 2019    12172.90
26 Dec 2019    12211.85
24 Dec 2019    12269.25
Name: Open, dtype: float64

In [127]:
nifty_2019['nifty50'].loc['31 Dec 2019']

Open     12247.10
High     12247.10
Low      12151.80
Close    12168.45
Name: 31 Dec 2019, dtype: float64

Task on the NIFTY datsets:

1. in 2019, how amny days was the NIFTY50 volatile(high> 105% of low)
2. in 2019, in how many days was the NIFTYNEXT50 volatile(high> 105% of low)
3. in 2019, how many days belonged to the four classes NIFTY50 volatile/ non-volatile and NIFTYNext50 volatile / non-volatile
4. Compute the mean, median, std, var of closing values for each weekday in NIFTY50 for 2019
5. Compute the mean, median, std, var of closing values for each month in NIFTY50 for 2019
6. On the days in which NIFTY50 closed higher than the open, what was the mean of(close-open) for NIFTYNext50
7. in 2019, how many days had the day's high lower than the previous day's low in NIFTY50
8. in 2019, on how many days did the day's close exceed the 30 day moving average in NIFTY50(exclude first month)